In [1]:
from scipy import stats

In [2]:
import pandas as pd
import numpy as np

In [4]:
data_a=pd.read_csv("C:/Users/HP/OneDrive/Desktop/happymonk/Electric_Production.csv")

In [5]:
data_b=pd.read_csv("C:/Users/HP/OneDrive/Desktop/happymonk/shorter data.csv")

In [7]:
data_a.head(10)

        DATE  IPG2211A2N
0   1/1/1985     72.5052
1   2/1/1985     70.6720
2   3/1/1985     62.4502
3   4/1/1985     57.4714
4   5/1/1985     55.3151
5   6/1/1985     58.0904
6   7/1/1985     62.6202
7   8/1/1985     63.2485
8   9/1/1985     60.5846
9  10/1/1985     56.3154

In [8]:
data_b.head(10)

   gender  age
0    male   25
1    male   25
2    male   22
3  female   23
4  female   21
5  female   20
6  female   23
7  female   21
8  female   20
9    male   22

In [33]:
data_1=data_a.iloc[:,-1]

In [35]:
data_2=data_b.iloc[:,-1]

In [34]:
data_1=data_1.to_numpy()

In [36]:
data_2=data_2.to_numpy()

In [37]:
ks_stat, p_value = stats.ks_2samp(data_1, data_2)

In [38]:
if p_value > 0.05:
    print("Datasets A and B likely come from the same distribution")
else:
    print("Datasets A and B do not appear to come from the same distribution")

Datasets A and B do not appear to come from the same distribution